/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   parser.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: daegulee <daegulee@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/10/05 10:53:58 by daegulee          #+#    #+#             */
/*   Updated: 2022/10/06 23:21:05 by daegulee         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "parser.h"
// push_down automata 이후에 토큰리스트 프리 푸시다운은 로컬로 들고감 
static const t_string	**g_lalr_table;

